package by.zemich.parserservice.core.enums;


public enum ETokenType {
    CLOTHES("""
                    кофт.{1}|
                    х.{1}лат|
                    п.{1}льто|
                    в.{1}тровк.{1}|
                    л.{1}син.{1}|
                    капр.{1}|
                    юбк.{1}|
                    юбк.{1}|
                    плать.{1}|
                    штанишки|
                    рубашк.{1}|
                    к.{1}рдиган.?|
                    сп.{1}ртивный к.{1}стюм.?|
                    к.{1}стюм двойка|
                    к.{1}стюм.?|
                    штаны|
                    штаны|
                    бр.{1}к.{1,2}|
                    куртк.{1}|
                    к.{1}лготк.{1}|
                    топик.?|
                    т.{1}лстовк.{1}|
                    бомбер.?|
                    н.{1}ски|
                    к.{1}мбин.{1}зон|
                    к.{1}мплект верхн.{1}й .{1}дежд.{1}|
                    в.{1}долазк.{1}
            """),
    NOT_IN_SIZE("мал.{1}мер|не в размер|мал.{1}мерка"),
    IN_SIZE("""
            в размер"|
            размер в размер
            """),
    SIZE("""
            (?<=размеры единый.{1}).+\\s|
            (?<=размер.?:).+\\s|
            (?<=размер.?).+\\s|
            (?<=размеры:).+\\s|
            (?<=размеры).+\\s
            """),
    COLOR("""
            бе.{1} выбора цвет.{1,2}|
            бе.{1} выбрать цвет|
            цвет.{1} бе.{1} выб.{1}р.?|
            фуксия|
            зел.{1}ный|
            синий|
            бел.{1}й|
            малин.{1}вый|
            ч.{1}рный|
            хаки|
            бежев.{1}й|
            изумрудн.{1}й|
            выбираем расцветочку|
                        
            """),
    FABRIC("""
            лайт|
            дву.*нитка|
            велюр|
            шерсть|
            барби|
            крепун|
            эластан|
            плащёвка|
            хлопок|
            ангора|
            кулирка|
            сингарур|
            лапша|
            масло|
            софт|
            бенгалин|
            сатин|
            поплин|
            прадо|
            флис.?|
            ш.{1}лк|
            вязанный акрил[л]?|
            трик.{1}таж
            """
    ),
    FLEECE("флис.*\\s"),
    SEASON("осен[ь]?-весна|осень-зима|зима|лет.{1}}|осень|в.{1}}сна|зимний|летн.{1}й"),

    SALE("р.{1}спр.{1}даж.{1}"),
    COST_PER_PEACE("""
            (?<=цена:\\s*)\\d+(?=\\s*р.*)|
            (?<=цена штучно\\s*)\\d+(?=\\s*р.*)|
            (?<=цена\\s*)\\d+(?=\\s*р.*)|
            (?<=цена )\\d+(?=₽)|
            (?<=цена )\\d+
            (?<=цена штучно:\\s*)\\d+(?=\\s*руб)
            """),
    COST_PER_SET("""
            (?<=цена\\s+.*\\s*комплект\\D* =)\\s+\\d+\\s*(?=р.*)|
            (?<=цена\\s*)\\d+(?=.*упаковк.*)
                      
            """),
    PRICE_KEY_WORDS("цен.*|сто.{1}мость|"),
    ONLY_SET_SALE("something");


    private final String regex;

    ETokenType(String regex) {
        this.regex = regex;
    }

    public String getRegex() {
        return regex;
    }
}